tap "dart-lang/dart", trusted: true
tap "espressif/eim"
tap "holtwick/tap"
tap "sass/sass", trusted: true

brew "ack"
brew "acme.sh"
brew "age"
brew "autoconf"
brew "automake"
brew "b2-tools"
brew "bat"
brew "binwalk"
brew "cask"
brew "ccache"
brew "certbot"
brew "cloudflared"
brew "cmake"
brew "colima"
brew "devcontainer"
brew "dfu-util"
brew "difftastic"
brew "direnv"
brew "dua-cli"
brew "duck"
brew "dust"
brew "earthly"
brew "espressif/eim/eim", trusted: true
brew "esptool"
brew "fish"
brew "fq"
brew "gh"
brew "ghidra", link: false
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glib"
brew "gnupg"
brew "go"
brew "gradle"
brew "hashcat"
brew "hf"
brew "holtwick/tap/bx", trusted: true
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "john-jumbo"
brew "jq"
brew "kubeconform"
brew "kubectx"
brew "libgcrypt"
brew "librsvg"
brew "libslirp"
brew "lima"
brew "minikube"
brew "mise"
brew "mosh"
brew "neovim"
brew "ninja"
brew "nmap"
brew "ollama"
brew "p7zip"
brew "pipenv"
brew "pipx"
brew "pixman"
brew "pkgconf"
brew "protobuf"
brew "pwgen"
brew "pwntools"
brew "python@3.13"
brew "python@3.14"
brew "qemu"
brew "restic"
brew "ripgrep"
brew "ruby", link: false
brew "ruby@3.3"
brew "rustup"
brew "sass/sass/migrator"
brew "sass/sass/sass"
brew "sdl2"
brew "shellcheck"
brew "smartmontools"
brew "starship"
brew "tmux"
brew "todoist-cli"
brew "uv"
brew "virtualenvwrapper"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "zsh-syntax-highlighting"

cask "codeql"
cask "cyberduck"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "ghidra"
cask "gimp"
cask "github"
cask "iterm2"
cask "macfuse"
cask "meld"
cask "mitmproxy"
cask "processmonitor"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "temurin"
cask "wezterm"
cask "zulu@17"

def is_corp?
  # Check for MDM enrollment (Enrolled via DEP: Yes)
  `profiles status -type enrollment 2>/dev/null`.include?("Enrolled via DEP: Yes")
end

if is_corp?
  brew "bazelisk", link: false
end

# non-corp
if !is_corp?
  brew "bazelisk"
  brew "openssh"
  brew "virt-manager"

  cask "claude-code"
  cask "codex"
  cask "cryptomator"
  cask "keepassxc"
  cask "gcloud-cli"
  cask "keybase"
  cask "orbstack"
  cask "jordanbaird-ice@beta"
  cask "veracrypt"
end
