brew "ack"
brew "acme.sh"
brew "age"
brew "bat"
brew "cask"
brew "certbot"
brew "cmake"
brew "colima"
brew "devcontainer"
brew "difftastic"
brew "direnv"
brew "earthly"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gradle"
brew "httpie"
brew "john-jumbo"
brew "jq"
brew "lima"
brew "mosh"
brew "pipenv"
brew "pipx"
brew "pkgconf"
brew "pwgen"
brew "pwntools"
brew "qemu"
brew "restic"
brew "ripgrep"
brew "ruby"
brew "ruby@3.3"
brew "rustup"
brew "scroll-reverser"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "virtualenvwrapper"
brew "zsh-syntax-highlighting"
cask "codeql"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "ghidra"
cask "gimp"
cask "github"
cask "iterm2"
cask "macfuse"
cask "meld"
cask "mitmproxy"
cask "raycast"
cask "temurin"
cask "veracrypt"
cask "zulu@17"

# non-corp
if ENV['USER'] != "davidtomaschik"
  brew "bazel"
  brew "openssh"
  cask "google-cloud-sdk"
end
